;---------------------------------------------------------------;
;	Copyright (c) 2019 data_work.asm
;	This software is released under the MIT License.
;	http://opensource.org/licenses/mit-license.php
;---------------------------------------------------------------; 

;---------------------------------------------------------------;
;	ワークやデータをアライメントの関係でまとめておくファイル
;---------------------------------------------------------------;

;---------------------------------------------------------------;
;	フリップ用テキスト描画ワーク
;---------------------------------------------------------------;
align 64
flip_text_render_buff:
	ds	4*16

;---------------------------------------------------------------;
;---------------------------------------------------------------;
align 256
dir_table:
	; 象限0 +dx,+dy
        db      04h, 04h, 04h, 04h, 04h, 04h, 04h, 04h  ; 00
        db      00h, 02h, 03h, 03h, 03h, 03h, 04h, 04h  ; 08
        db      00h, 01h, 02h, 03h, 03h, 03h, 03h, 03h  ; 10
        db      00h, 01h, 01h, 02h, 02h, 03h, 03h, 03h  ; 18
        db      00h, 01h, 01h, 02h, 02h, 02h, 03h, 03h  ; 20
        db      00h, 01h, 01h, 01h, 02h, 02h, 02h, 02h  ; 28
        db      00h, 00h, 01h, 01h, 01h, 02h, 02h, 02h  ; 30
        db      00h, 00h, 01h, 01h, 01h, 02h, 02h, 02h  ; 38

	; 象限1 +dx,-dy
        db      04h, 04h, 04h, 04h, 04h, 04h, 04h, 04h  ; 00
        db      08h, 06h, 05h, 05h, 05h, 05h, 04h, 04h  ; 08
        db      08h, 07h, 06h, 05h, 05h, 05h, 05h, 05h  ; 10
        db      08h, 07h, 07h, 06h, 06h, 05h, 05h, 05h  ; 18
        db      08h, 07h, 07h, 06h, 06h, 06h, 05h, 05h  ; 20
        db      08h, 07h, 07h, 07h, 06h, 06h, 06h, 06h  ; 28
        db      08h, 08h, 07h, 07h, 07h, 06h, 06h, 06h  ; 30
        db      08h, 08h, 07h, 07h, 07h, 06h, 06h, 06h  ; 38

	; 象限3 -dx,+dy
        db      0Ch, 0Ch, 0Ch, 0Ch, 0Ch, 0Ch, 0Ch, 0Ch  ; 00
        db      00h, 0Eh, 0Dh, 0Dh, 0Dh, 0Dh, 0Ch, 0Ch  ; 08
        db      00h, 0Fh, 0Eh, 0Dh, 0Dh, 0Dh, 0Dh, 0Dh  ; 10
        db      00h, 0Fh, 0Fh, 0Eh, 0Eh, 0Dh, 0Dh, 0Dh  ; 18
        db      00h, 0Fh, 0Fh, 0Eh, 0Eh, 0Eh, 0Dh, 0Dh  ; 20
        db      00h, 0Fh, 0Fh, 0Fh, 0Eh, 0Eh, 0Eh, 0Eh  ; 28
        db      00h, 00h, 0Fh, 0Fh, 0Fh, 0Eh, 0Eh, 0Eh  ; 30
        db      00h, 00h, 0Fh, 0Fh, 0Fh, 0Eh, 0Eh, 0Eh  ; 38

	; 象限2 -dx,-dy
        db      0Ch, 0Ch, 0Ch, 0Ch, 0Ch, 0Ch, 0Ch, 0Ch  ; 00
        db      08h, 0Ah, 0Bh, 0Bh, 0Bh, 0Bh, 0Ch, 0Ch  ; 08
        db      08h, 09h, 0Ah, 0Bh, 0Bh, 0Bh, 0Bh, 0Bh  ; 10
        db      08h, 09h, 09h, 0Ah, 0Ah, 0Bh, 0Bh, 0Bh  ; 18
        db      08h, 09h, 09h, 0Ah, 0Ah, 0Ah, 0Bh, 0Bh  ; 20
        db      08h, 09h, 09h, 09h, 0Ah, 0Ah, 0Ah, 0Ah  ; 28
        db      08h, 08h, 09h, 09h, 09h, 0Ah, 0Ah, 0Ah  ; 30
        db      08h, 08h, 09h, 09h, 09h, 0Ah, 0Ah, 0Ah  ; 38

;---------------------------------------------------------------; 
;	キャラクタ関連のワーク
;---------------------------------------------------------------; 

CHR_KIND	equ	00h
CHR_PATTERN	equ	01h
CHR_STEP	equ	02h

; X座標は整数部 9bit: 小数部: 7bitで行ってみる。
; 表示は整数部を使い、当たり判定は整数部の上位8bit(=2の倍数)で高速化する。
CHR_POSXL	equ	03h
CHR_POSXH	equ	04h

; 当り判定用のサイズ(X), 高速化のためCHR_POSXHの次に配置
; POSX整数部と判定を行うため、実サイズでは２倍の幅になる。
; 例: 8 → 実座標±16
CHR_SIZEX	equ	05h

; Y座標は整数部 8bit: 小数部: 8bitで行う。
; 表示,当り判定は整数部を使う。
; POSYと判定を行うため、実サイズの高さになる。
; 例: 8 → 実座標±8
CHR_POSYL	equ	06h
CHR_POSYH	equ	07h

; 当り判定用のサイズ(Y), 高速化のためCHR_POSYHの次に配置
CHR_SIZEY	equ	08h

; 汎用ワーク
CHR_WORK0	equ	09h
CHR_WORK1	equ	0ah
CHR_WORK2	equ	0bh
CHR_WORK3	equ	0ch

; スコアタイプ (未使用)
SCORE_TYPE	equ	0dh

; 初期パラメータ (未使用)
CHR_PARAM	equ	0eh

CHR_SIZE	equ	010h


;---------------------------------------------------------------; 
CHARA_NUM	equ	(31)

align 256

chara_work:
	ds	CHR_SIZE * CHARA_NUM

;---------------------------------------------------------------;
;	テキスト描画用
;---------------------------------------------------------------;
; キャラクタ数
num_buff:
	db	00h,00h

;---------------------------------------------------------------;
;---------------------------------------------------------------;

;	END
